{
    "format": "layers-model",
    "generatedBy": "keras v3.10.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_3",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_layer_3",
                            "batch_input_shape": [
                                1,
                                null
                            ]
                        }
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "input_dim": 68,
                            "output_dim": 256,
                            "embeddings_initializer": {
                                "module": "keras.initializers",
                                "class_name": "RandomUniform",
                                "config": {
                                    "seed": null,
                                    "minval": -0.05,
                                    "maxval": 0.05
                                },
                                "registered_name": null
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": true,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 1024,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 68,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ],
                "build_input_shape": [
                    1,
                    null
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of6.bin",
                "group1-shard2of6.bin",
                "group1-shard3of6.bin",
                "group1-shard4of6.bin",
                "group1-shard5of6.bin",
                "group1-shard6of6.bin"
            ],
            "weights": [
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        1024,
                        68
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        68
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding_4/embeddings",
                    "shape": [
                        68,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell/kernel",
                    "shape": [
                        256,
                        4096
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell/recurrent_kernel",
                    "shape": [
                        1024,
                        4096
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell/bias",
                    "shape": [
                        4096
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}